<a href="https://colab.research.google.com/github/Nolanole/DS-Unit-1-Sprint-1-Dealing-With-Data/blob/master/Josh_Mancuso_Code_Challenge_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
# Task 1 - Pandas Library Import here: 
import pandas as pd

In [13]:
# Task 2 - Load three datasets and display 5 rows of data for each dataset:

df1 = pd.read_csv('https://raw.githubusercontent.com/pierretd/datasets-1/master/BlackFriday.csv')
df1.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [7]:
df2 = pd.read_json('https://raw.githubusercontent.com/pierretd/datasets-1/master/PeopleInSpaceNow.json')
df2.head()

   message  number                                             people
0  success       3       {'name': 'Sergey Prokopyev', 'craft': 'ISS'}
1  success       3        {'name': 'Alexander Gerst', 'craft': 'ISS'}
2  success       3  {'name': 'Serena Aunon-Chancellor', 'craft': '...

In [8]:
df3 = pd.read_csv('https://raw.githubusercontent.com/pierretd/datasets-1/master/FastFmProfiles.tsv', sep='\t')
df3.head()

           #id gender   age        country    registered
0  user_000001      m   NaN          Japan  Aug 13, 2006
1  user_000002      f   NaN           Peru  Feb 24, 2006
2  user_000003      m  22.0  United States  Oct 30, 2005
3  user_000004      f   NaN            NaN  Apr 26, 2006
4  user_000005      m   NaN       Bulgaria  Jun 29, 2006

In [19]:
#1) Clean the data set and drop the Null/NaN values. Rename  Product_Category_1-3 columns with an actual Product. 

#rename Product columns
df1 = df1.rename(columns={'Product_Category_1': 'Shirts', 'Product_Category_2': 'Jeans', 'Product_Category_3': 'Boots'})

#Fill null values w/ zero:
df1 = df1.fillna(value=0)

df1.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Shirts,Jeans,Boots,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,0.0,0.0,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,0.0,0.0,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,0.0,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,0.0,0.0,7969

In [20]:
#2) How many unique user_ids does the data set contain?

num_unique_ids = df1.User_ID.nunique()
print(num_unique_ids)

5891

In [31]:
#3) How many unique age brackets are in the dataset. Which Age bracket has the most entries? Which has the least?

num_unique_age_brackets = df1.Age.nunique()
print('Number of unique age brackets is: ' + str(num_unique_age_brackets) + '\n')

df1.Age.value_counts()

#Age bracket w/ most and least entries:
most = '26-35'
print('Age bracket w/ the most entries is ' + most + '\n')

least = '0-17'
print('Age bracket w/ the least entries is ' + least)

Number of unique age brackets is: 7

Age bracket w/ the most entries is 26-35

Age bracket w/ the least entries is 0-17

In [33]:
#4) Transform the Gender categorical variable into a numerical variable. Then transform that numerical value into a Boolean.

df1.Gender = df1.Gender.replace(to_replace='F', value=0)
df1.Gender = df1.Gender.replace(to_replace='M', value=1)

df1.Gender.value_counts()

1    405380
0    132197
Name: Gender, dtype: int64

In [36]:
#5)What is the average Occupation score? What is the Standard Deviation? What is the maximum and minimum value?
print("avg occupation score is: " + str(df1.Occupation.mean()))

avg occupation score is: 8.082710011775058